artillery/test.yml
config:
  target: "https://jsonplaceholder.typicode.com"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Normal yük testi"
    - duration: 30
      arrivalRate: 10
      name: "Artan yük testi"
    - duration: 20
      arrivalRate: 20
      name: "Yoğun yük testi"

  payload:
    path: "payload.csv"
    fields: 
      - "title"
      - "body"
      - "userId"

  ensure:
    - "http.response_time.p95 < 500"
    - "http.response_time.min < 100"
    - "http.requestsCompleted > 50"

scenarios:
  - name: "API GET ve POST istekleri"
    flow:
      - get:
          url: "/posts/1"
          expect:
            - statusCode: 200

      - post:
          url: "/posts"
          json:
            title: "{{ title }}"
            body: "{{ body }}"
            userId: "{{ userId }}"
          expect:
            - statusCode: 201